rails_practice_tests/seth_schoenfeld/build_rails_project/BlogApp/app/controllers/users_controller.rb

    def create

      @user = User.create(user_params)
      if @user.save
---
INSERT INTO "users" ("email", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["email", "blogging@blog.com"], ["created_at", "2019-09-20 19:03:20.811060"], ["updated_at", "2019-09-20 19:03:20.811060"]]
INSERT INTO "users" ("email", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["email", "blah@blah.com"], ["created_at", "2019-09-20 23:05:19.955365"], ["updated_at", "2019-09-20 23:05:19.955365"]]