w6d2/routes_controllers/app/controllers/users_controller.rb

  def index
    debugger
    users_all = User.select(:name,:email)
---
SELECT "users"."name", "users"."email" FROM "users"

  def create

    user = User.new(params.require(:user).permit( [':name'],[':email'] ) )
   debugger
    user[:name] = params[:user][':name']
    user[:email] = params[:user][':email']
    user.save!
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Yngwe_Malmsteen"], ["email", "ichschnay@yngvel.no"], ["created_at", "2020-12-30 03:41:38.395724"], ["updated_at", "2020-12-30 03:41:38.395724"]]