W8D1/our_reddit/app/models/user.rb

  def reset_session_token!
    self.session_token = SecureRandom.base64
    self.save!
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "Bt0h+IRTRhfT7F4T4G/BQw=="], ["updated_at", "2021-01-11 22:37:39.123351"], ["id", 1]]