w6d4/ninety_nine_cats/app/controllers/cats_controller.rb

INSERT INTO "cats" ("birth_date", "color", "name", "sex", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
    def create
      debugger
      @cat = Cat.new(cat_params)

      if @cat.save

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "cats" SET "name" = $1, "updated_at" = $2 WHERE "cats"."id" = $3  [["name", "Chevy Chase"], ["updated_at", "2021-01-01 04:20:29.566578"], ["id", 5]]
---
    def update

      cat = Cat.find(params[:id])

      success = cat.update( cat_params )

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
DELETE FROM "cats" WHERE "cats"."id" = $1  [["id", 9]]
---
    def destroy
      cat = Cat.find(params[:id])
      cat.destroy